{
  "resumeText": "SOFIA RAMIREZ\nSan Francisco, CA • sofia@example.com • github.com/sofiaramirez\n\nSUMMARY\nSenior product engineer leading end-to-end delivery of accessible React and Node.js web experiences for 15M+ monthly users. Expert in experimentation strategy, resilient API design, and data instrumentation, with a track record of mentoring teams toward a growth mindset.\n\nEXPERIENCE\nSenior Product Engineer — Loop Labs (2021–Present)\n- Led cross-functional pods delivering end-to-end experimentation journeys in React and Node.js, shipping 30+ tests annually and lifting activation 15%.\n- Modernized experimentation platform with TypeScript and GraphQL APIs plus observability guardrails, cutting launch time 40% while sustaining <0.2% error rates.\n- Drove WCAG AA design system adoption across 12 surfaces, unlocking inclusive customer flows and faster delivery cycles.\n- Built mentoring and growth mindset programs for 6 engineers, increasing deployment confidence scores 25% and seeding org-wide instrumentation standards.\n\nProduct Engineer — Brightline (2018–2021)\n- Owned discovery-to-launch of experimentation dashboards that enabled PM self-service and improved activation by 9%.\n- Designed Node.js services and data tracking plans to capture experiment telemetry, improving decision accuracy 20%.\n- Facilitated cross-functional growth mindset workshops that aligned engineering and product on rapid learning loops.\n\nPROJECTS\nImpact Review Automation — Automated GPT-powered insight pack generation for experiment reviews, saving 30 hours/quarter and standardizing instrumentation handoffs.\n\nEDUCATION\nB.S. Computer Science, University of Texas at Austin\n\nSKILLS\nReact, Node.js, GraphQL, Accessibility, Experimentation, Mentoring, Data instrumentation, TypeScript",
  "jobDescription": "We need a senior product engineer to lead end-to-end delivery of web experiences. Key focuses: React, Node.js, experimentation, API design, accessibility, data instrumentation, mentoring, growth mindset.",
  "jobSkills": [
    "React",
    "Node.js",
    "Experimentation",
    "API design",
    "Accessibility",
    "Data instrumentation",
    "Mentoring",
    "Growth mindset"
  ],
  "resumeSkills": [
    "React",
    "Node.js",
    "GraphQL",
    "Accessibility",
    "Experimentation",
    "Mentoring",
    "Data instrumentation",
    "TypeScript"
  ]
}
